app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("userName", "password", "firstName", "lastName", "gender", "created_at", "updated_at", "birthDate") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "password" = ?, "updated_at" = ?, "birthDate" = ? WHERE "users"."id" = ?  [["password", "[FILTERED]"], ["updated_at", "2022-03-02 00:10:15.090450"], ["birthDate", "1993-02-25"], ["id", 9]]